{
    "outcomes":[
    {
        "ComputerScience":[
            "Analyze a complex computing problem and to apply principles of computing and other relevant disciplines to identify solutions.",
            "Design, implement, and evaluate a computing-based solution to meet a given set of computing requirements in the context of the program’s discipline.",
            "Communicate effectively in a variety of professional contexts.",
            "Recognize professional responsibilities and make informed judgements in computing practice based on legal and ethical principles.",
            "Function effectively as a member or leader of a team engaged in activities appropriate to the program’s discipline.",
            "Apply computer science theory and software development fundamentals to produce computing-based solutions."
        ]
    },
    {
        "ComputerEngineering":[
            "Identify, formulate, and solve complex engineering problems by applying principles of engineering, science, and mathematics.",
            "Apply engineering design to produce solutions that meet specified needs with consideration of public health, safety, and welfare, as well as global, cultural, social, environmental, and economic factors.",
            "Communicate effectively with a range of audiences.",
            "Recognize ethical and professional responsibilities in engineering situations and make informed judgments, which must consider the impact of engineering solutions in global, economic, environmental, and societal contexts.",
            "Function effectively on a team whose members together provide leadership, create a collaborative and inclusive environment, establish goals, plan tasks, and meet objectives.",
            "Develop and conduct appropriate experimentation, analyze and interpret data, and use engineering judgment to draw conclusions.",
            "Acquire and apply new knowledge as needed, using appropriate learning strategies."
        ]
    },
    {
        "InformationTechnology":[
            "Analyze a complex computing problem and to apply principles of computing and other relevant disciplines to identify solutions.",
            "Design, implement, and evaluate a computing-based solution to meet a given set of computing requirements in the context of the program’s discipline.",
            "Communicate effectively in a variety of professional contexts.",
            "Recognize professional responsibilities and make informed judgments in computing practice based on legal and ethical principles.",
            "Function effectively as a member or leader of a team engaged in activities appropriate to the program’s discipline.",
            "Identify and analyze user needs and to take them into account in the selection, creation, integration, evaluation, and administration of computing-based systems."
        ]
    },
    {
        "Cybersecurity":[

        ]
    }
    ]
}