{
  "InstructorQuestions": [
    "The instructor was well prepared for class.",
    "Individual class meetings were well prepared.",
    "The instructor used class time effectively.",
    "The instructor was organized, well prepared, and used class time efficiently.",
    "The instructor communicated clearly and was easy to understand.",
    "The instructor encouraged student participation in class.",
    "The instructor presented course material in a clear manner that facilitated understanding.",
    "The instructor effectively organized and facilitated well-run learning activities.",
    "The instructor’s teaching methods were effective.",
    "The instructor’s teaching methods aided my learning.",
    "The instructor stimulated my interest in the subject matter.",
    "The instructor provided helpful feedback.",
    "The instructor provided feedback in a timely manner.",
    "The instructor returned assignments and exams in a timely manner.",
    "The online course platform was updated and accurate.",
    "The instructor effectively explained and illustrated course concepts.",
    "The instructor’s feedback to me was helpful and improved my understanding of the material.",
    "I was able to access the instructor outside of scheduled class time for additional help.",
    "The instructor was available to students.",
    "I could get help if I needed it.",
    "The instructor cared about the students, their progress, and successful course completion.",
    "The instructor created a welcoming and inclusive learning environment.",
    "The instructor treated students with respect."
  ],
  "TAquestions": [
    "Graded consistently and in a timely manner; worked with a clear grading scheme; gave sufficient feedback on papers.",
    "The TA was willing to explain grading and evaluation of my work.",
    "The TA knew and was confident in the material related to this course.",
    "The TA was clear in explaining subject matter.",
    "The TA explained the material in an interesting and engaging way.",
    "The TA fostered intellectual communication among my peers.",
    "The TA stimulated thought and discussion.",
    "I felt comfortable asking my TA questions.",
    "The TA was able to answer questions clearly and completely.",
    "The TA effectively utilizes electronic communication (e.g., Canvas, email, etc.).",
    "The TA is well-prepared for each meeting.",
    "The TA was available during offices hours or by appointment.",
    "The TA was committed to teaching and aiding students.",
    "Overall, the TA performed well."
  ]
}